{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "name": "conv2d_1/kernel", "shape": [3, 3, 1, 32]}, {"dtype": "float32", "name": "conv2d_1/bias", "shape": [32]}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "name": "conv2d_2/kernel", "shape": [3, 3, 32, 64]}, {"dtype": "float32", "name": "conv2d_2/bias", "shape": [64]}]}, {"paths": ["group3-shard1of2", "group3-shard2of2"], "weights": [{"dtype": "float32", "name": "dense_1/kernel", "shape": [9216, 128]}, {"dtype": "float32", "name": "dense_1/bias", "shape": [128]}]}, {"paths": ["group4-shard1of1"], "weights": [{"dtype": "float32", "name": "dense_2/kernel", "shape": [128, 10]}, {"dtype": "float32", "name": "dense_2/bias", "shape": [10]}]}], "modelTopology": {"backend": "tensorflow", "training_config": {"loss": "categorical_crossentropy", "metrics": ["accuracy"], "loss_weights": null, "optimizer_config": {"class_name": "Adadelta", "config": {"lr": 1.0, "decay": 0.0, "epsilon": 1e-07, "rho": 0.95}}, "sample_weight_mode": null}, "model_config": {"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "filters": 32, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "trainable": true, "padding": "valid", "bias_constraint": null, "use_bias": true, "strides": [1, 1], "dtype": "float32", "activation": "relu", "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_1", "batch_input_shape": [null, 28, 28, 1]}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "trainable": true, "padding": "valid", "bias_constraint": null, "use_bias": true, "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_2"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.25, "trainable": true, "name": "dropout_1", "seed": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "trainable": true, "activation": "relu", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "units": 128, "kernel_constraint": null, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.5, "trainable": true, "name": "dropout_2", "seed": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "trainable": true, "activation": "softmax", "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "units": 10, "kernel_constraint": null, "name": "dense_2"}}]}, "keras_version": "2.1.5"}}